const Lists =
  [
    {
      id: '000',
      name: '事项指南',
      parent: null
    },
    {
      id: '001',
      name: '区级事项',
      parent: '000'
    },
    {
      id: '002',
      name: '法人业务',
      parent: '001'
    },
    {
      id: '003',
      name: '就业创业',
      parent: '002'
    },
    {
      id: '004',
      name: '创业补贴',
      parent: '003'
    },
    {
      id: '005',
      name: '创业带动就业补贴',
      parent: '004'
    },
    {
      id: '006',
      name: '创业企业社会保险补贴',
      parent: '004'
    },
    {
      id: '007',
      name: '创业项目征集补贴',
      parent: '004'
    },
    {
      id: '008',
      name: '广州市创业孵化补贴申领',
      parent: '004'
    },
    {
      id: '009',
      name: '社区就业服务补贴',
      parent: '004'
    },
    {
      id: '010',
      name: '社区就业岗位补贴',
      parent: '004'
    },
    {
      id: '011',
      name: '社区就业社保补贴',
      parent: '004'
    },
    {
      id: '012',
      name: '招用工岗位补贴',
      parent: '004'
    },
    {
      id: '013',
      name: '招用工社会保险补贴',
      parent: '004'
    },
    {
      id: '014',
      name: '职业介绍补贴',
      parent: '004'
    },
    {
      id: '015',
      name: '就失业登记',
      parent: '003'
    },
    {
      id: '016',
      name: '就业登记',
      parent: '015'
    },
    {
      id: '017',
      name: '台港澳人员在内地就业许可',
      parent: '003'
    },
    {
      id: '018',
      name: '出具失业证明',
      parent: '017'
    },
    {
      id: '019',
      name: '就业证补发',
      parent: '017'
    },
    {
      id: '020',
      name: '就业证项目变更（不含就业单位变更）',
      parent: '017'
    },
    {
      id: '021',
      name: '就业证注销',
      parent: '017'
    },
    {
      id: '022',
      name: '失业登记',
      parent: '017'
    },
    {
      id: '023',
      name: '台港澳人员在内地就业许可（初次聘用、就业单位变更和异地迁入就业）',
      parent: '017'
    },
    {
      id: '024',
      name: '台港澳人员在内地就业许可（续聘）',
      parent: '017'
    },
    {
      id: '025',
      name: '劳动保障',
      parent: '002'
    },
    {
      id: '026',
      name: '工伤鉴定',
      parent: '025'
    },
    {
      id: '027',
      name: '工伤认定申请',
      parent: '026'
    },
    {
      id: '028',
      name: '工伤事故报告上报',
      parent: '026'
    },
    {
      id: '029',
      name: '集体合同审查',
      parent: '025'
    },
    {
      id: '030',
      name: '经济性裁员备案',
      parent: '025'
    },
    {
      id: '031',
      name: '劳务派遣经营许可',
      parent: '025'
    },
    {
      id: '032',
      name: '劳务派遣单位分公司经营劳务派遣备案',
      parent: '031'
    },
    {
      id: '033',
      name: '劳务派遣单位设立分公司报告',
      parent: '031'
    },
    {
      id: '034',
      name: '劳务派遣经营许可证变更',
      parent: '031'
    },
    {
      id: '035',
      name: '劳务派遣经营许可证补证',
      parent: '031'
    },
    {
      id: '036',
      name: '劳务派遣经营许可证申请',
      parent: '031'
    },
    {
      id: '037',
      name: '劳务派遣经营许可证申请延续',
      parent: '031'
    },
    {
      id: '038',
      name: '劳务派遣经营许可证注销',
      parent: '031'
    },
    {
      id: '039',
      name: '劳务派遣上一年度经营情况报告',
      parent: '031'
    },
    {
      id: '040',
      name: '实行不定时工作制和综合计算工时工作制审批',
      parent: '025'
    },
    {
      id: '041',
      name: '用人单位招收使用未成年工登记备案',
      parent: '025'
    },
    {
      id: '042',
      name: '人事人才',
      parent: '002'
    },
    {
      id: '043',
      name: '人才引进',
      parent: '042'
    },
    {
      id: '044',
      name: '异地人才引进（含技能人才）',
      parent: '043'
    },
    {
      id: '045',
      name: '人才中介',
      parent: '042'
    },
    {
      id: '046',
      name: '举办人才交流会备案',
      parent: '045'
    },
    {
      id: '047',
      name: '职业介绍（人才中介服务）机构设立许可',
      parent: '045'
    },
    {
      id: '048',
      name: '人力资源服务许可证变更',
      parent: '047'
    },
    {
      id: '049',
      name: '人力资源服务许可证设立',
      parent: '047'
    },
    {
      id: '050',
      name: '人力资源服务许可证注销',
      parent: '047'
    },
    {
      id: '051',
      name: '职业技能',
      parent: '042'
    },
    {
      id: '052',
      name: '民办职业培训机构广告备案',
      parent: '051'
    },
    {
      id: '053',
      name: '民办职业培训学校设立审批',
      parent: '051'
    },
    {
      id: '054',
      name: '办学许可证期满换证',
      parent: '053'
    },
    {
      id: '055',
      name: '变更办学地址',
      parent: '053'
    },
    {
      id: '056',
      name: '变更董（理）事会备案',
      parent: '053'
    },
    {
      id: '057',
      name: '变更法定代表人',
      parent: '053'
    },
    {
      id: '058',
      name: '变更培训机构名称',
      parent: '053'
    },
    {
      id: '059',
      name: '变更校长（院长、专职副院长）',
      parent: '053'
    },
    {
      id: '060',
      name: '民办职业培训学校设立',
      parent: '053'
    },
    {
      id: '061',
      name: '增加培训工种（专业）',
      parent: '053'
    },
    {
      id: '062',
      name: '注销办学许可证',
      parent: '053'
    },
    {
      id: '063',
      name: '社会保险',
      parent: '002'
    },
    {
      id: '064',
      name: '工伤保险',
      parent: '063'
    },
    {
      id: '065',
      name: '审核工伤保险先行支付待遇',
      parent: '064'
    },
    {
      id: '066',
      name: '子项',
      parent: '065'
    },
    {
      id: '067',
      name: '审核工伤人员待遇',
      parent: '064'
    },
    {
      id: '068',
      name: '审核工伤食宿交通费',
      parent: '064'
    },
    {
      id: '069',
      name: '审核工伤医疗费资格',
      parent: '064'
    },
    {
      id: '070',
      name: '审核工亡待遇',
      parent: '064'
    },
    {
      id: '071',
      name: '工伤死亡人员待遇',
      parent: '070'
    },
    {
      id: '072',
      name: '工亡供养亲属待遇',
      parent: '070'
    },
    {
      id: '073',
      name: '审核老工伤人员伤残待遇',
      parent: '064'
    },
    {
      id: '074',
      name: '社保查询、变更、转移等业务',
      parent: '063'
    },
    {
      id: '075',
      name: '不缴费人员增员',
      parent: '074'
    },
    {
      id: '076',
      name: '待遇信息变更',
      parent: '074'
    },
    {
      id: '077',
      name: '单位还款处理',
      parent: '074'
    },
    {
      id: '078',
      name: '单位欠费到账实收',
      parent: '074'
    },
    {
      id: '079',
      name: '单位欠款核销',
      parent: '074'
    },
    {
      id: '080',
      name: '单位社保资料变更（参保单位资料变更（社保部分））',
      parent: '074'
    },
    {
      id: '081',
      name: '地税全责征收缴费历史修订（地税全责缴费历史修订）',
      parent: '074'
    },
    {
      id: '082',
      name: '地税已退费数据修订',
      parent: '074'
    },
    {
      id: '083',
      name: '人员单位间转移',
      parent: '074'
    },
    {
      id: '084',
      name: '社保待遇补拨补扣',
      parent: '074'
    },
    {
      id: '085',
      name: '社保待遇补退',
      parent: '074'
    },
    {
      id: '086',
      name: '社保待遇收回',
      parent: '074'
    },
    {
      id: '087',
      name: '社保待遇停续',
      parent: '074'
    },
    {
      id: '088',
      name: '社保待遇资格认证',
      parent: '074'
    },
    {
      id: '089',
      name: '社保咨询及查询',
      parent: '074'
    },
    {
      id: '090',
      name: '社区、村信息变更',
      parent: '074'
    },
    {
      id: '091',
      name: '失业保险',
      parent: '063'
    },
    {
      id: '092',
      name: '申领按月失业待遇',
      parent: '091'
    },
    {
      id: '093',
      name: '申领失业保险稳岗补贴',
      parent: '091'
    },
    {
      id: '094',
      name: '失业保险视同缴费年限维护',
      parent: '091'
    },
    {
      id: '095',
      name: '失业保险转出',
      parent: '091'
    },
    {
      id: '096',
      name: '失业保险转入',
      parent: '091'
    },
    {
      id: '097',
      name: '失业保险关系省内转入申请',
      parent: '096'
    },
    {
      id: '098',
      name: '养老保险',
      parent: '063'
    },
    {
      id: '099',
      name: '部分军队退役人员和军队复员干部军龄视同医保缴费年限审核',
      parent: '098'
    },
    {
      id: '100',
      name: '养老保险视同缴费年限由本市审核确认的人员',
      parent: '099'
    },
    {
      id: '101',
      name: '养老保险视同缴费年限由省社保局审核确认的人员',
      parent: '099'
    },
    {
      id: '102',
      name: '城乡养老减员',
      parent: '098'
    },
    {
      id: '103',
      name: '城乡养老欠费核销',
      parent: '098'
    },
    {
      id: '104',
      name: '城乡养老实缴退费',
      parent: '098'
    },
    {
      id: '105',
      name: '城乡养老特批补收',
      parent: '098'
    },
    {
      id: '106',
      name: '城乡养老一次性缴费',
      parent: '098'
    },
    {
      id: '107',
      name: '城乡养老增员',
      parent: '098'
    },
    {
      id: '108',
      name: '城镇企业职工基本养老保险关系跨省、省内转出',
      parent: '098'
    },
    {
      id: '109',
      name: '城镇企业职工基本养老保险关系跨省、省内转入',
      parent: '098'
    },
    {
      id: '110',
      name: '跨省养老保险转入申请（一般帐户）',
      parent: '109'
    },
    {
      id: '111',
      name: '城镇职工基本养老保险死亡待遇（退休）',
      parent: '098'
    },
    {
      id: '112',
      name: '城镇职工基本养老保险死亡待遇（在职）',
      parent: '098'
    },
    {
      id: '113',
      name: '单位退统筹缴费历史恢复',
      parent: '098'
    },
    {
      id: '114',
      name: '关闭破产企业人员趸缴养老保险核定（关闭破产企业人员趸缴）',
      parent: '098'
    },
    {
      id: '115',
      name: '机关事业单位人员一次性缴费年限审核',
      parent: '098'
    },
    {
      id: '116',
      name: '企业职工基本养老保险视同缴费年限审核',
      parent: '098'
    },
    {
      id: '117',
      name: '特殊工种提前退休审批',
      parent: '098'
    },
    {
      id: '118',
      name: '退费处理（城镇职工基本养老保险类退费处理）',
      parent: '098'
    },
    {
      id: '119',
      name: '养老保险视同缴费年限维护',
      parent: '098'
    },
    {
      id: '120',
      name: '因病或非因工致残提前退休审批',
      parent: '098'
    },
    {
      id: '121',
      name: '早期离开国有集体企业人员一次性缴费年限审核',
      parent: '098'
    },
    {
      id: '122',
      name: '早期下乡知青一次性缴费年限审核',
      parent: '098'
    },
    {
      id: '123',
      name: '征地项目业务',
      parent: '063'
    },
    {
      id: '124',
      name: '被征地农民养老保障审核',
      parent: '123'
    },
    {
      id: '125',
      name: '预存款部分退回',
      parent: '123'
    },
    {
      id: '126',
      name: '预存款参农转居用款或退费',
      parent: '123'
    },
    {
      id: '127',
      name: '预存款已到账项目调差',
      parent: '123'
    },
    {
      id: '128',
      name: '预存款整体退回',
      parent: '123'
    },
    {
      id: '129',
      name: '征地项目基本资料录入',
      parent: '123'
    },
    {
      id: '130',
      name: '征地预存款项目新增或未到账前修改',
      parent: '123'
    },
    {
      id: '131',
      name: '征地预存资金划拨',
      parent: '123'
    },
    {
      id: '132',
      name: '个人业务',
      parent: '001'
    },
    {
      id: '133',
      name: '就业创业',
      parent: '132'
    },
    {
      id: '134',
      name: '《企业实体吸纳失业人员认定证明》审核',
      parent: '133'
    },
    {
      id: '135',
      name: '创业补贴',
      parent: '133'
    },
    {
      id: '136',
      name: '创业项目征集补贴',
      parent: '135'
    },
    {
      id: '137',
      name: '公益性岗位补贴',
      parent: '135'
    },
    {
      id: '138',
      name: '广州市创业租金补贴申领',
      parent: '135'
    },
    {
      id: '139',
      name: '灵活就业补贴',
      parent: '135'
    },
    {
      id: '140',
      name: '一次性创业资助',
      parent: '135'
    },
    {
      id: '141',
      name: '广州市创业担保贷款人员认定',
      parent: '133'
    },
    {
      id: '142',
      name: '就失业登记',
      parent: '133'
    },
    {
      id: '143',
      name: '就业登记',
      parent: '142'
    },
    {
      id: '144',
      name: '失业登记',
      parent: '142'
    },
    {
      id: '145',
      name: '失业人员人事档案管理',
      parent: '142'
    },
    {
      id: '146',
      name: '劳动保障',
      parent: '132'
    },
    {
      id: '147',
      name: '工伤鉴定',
      parent: '146'
    },
    {
      id: '148',
      name: '工伤认定申请',
      parent: '147'
    },
    {
      id: '149',
      name: '工伤事故报告上报',
      parent: '147'
    },
    {
      id: '150',
      name: '人事人才',
      parent: '132'
    },
    {
      id: '151',
      name: '人才引进',
      parent: '150'
    },
    {
      id: '152',
      name: '异地人才引进（含技能人才）',
      parent: '151'
    },
    {
      id: '153',
      name: '社会保险',
      parent: '132'
    },
    {
      id: '154',
      name: '工伤保险',
      parent: '153'
    },
    {
      id: '155',
      name: '工伤人员信息变更',
      parent: '154'
    },
    {
      id: '156',
      name: '子项',
      parent: '155'
    },
    {
      id: '157',
      name: '审核工伤保险先行支付待遇',
      parent: '154'
    },
    {
      id: '158',
      name: '审核工伤人员待遇',
      parent: '154'
    },
    {
      id: '159',
      name: '审核工伤食宿交通费',
      parent: '154'
    },
    {
      id: '160',
      name: '审核工伤医疗费资格',
      parent: '154'
    },
    {
      id: '161',
      name: '审核工亡待遇',
      parent: '154'
    },
    {
      id: '162',
      name: '工伤死亡人员待遇',
      parent: '161'
    },
    {
      id: '163',
      name: '工亡供养亲属待遇',
      parent: '161'
    },
    {
      id: '164',
      name: '审核老工伤人员伤残待遇',
      parent: '154'
    },
    {
      id: '165',
      name: '社保查询、变更、转移等业务',
      parent: '153'
    },
    {
      id: '166',
      name: '板块间人员合并',
      parent: '165'
    },
    {
      id: '167',
      name: '不缴费人员增员',
      parent: '165'
    },
    {
      id: '168',
      name: '城乡人员资料变更',
      parent: '165'
    },
    {
      id: '169',
      name: '待遇信息变更',
      parent: '165'
    },
    {
      id: '170',
      name: '地税全责征收缴费历史修订（地税全责缴费历史修订）',
      parent: '165'
    },
    {
      id: '171',
      name: '地税全责征收前一次性缴费历史修订（全责前一次性缴费历史修订）',
      parent: '165'
    },
    {
      id: '172',
      name: '地税全责征收一次性缴费历史修订（地税一次性缴费历史修订）',
      parent: '165'
    },
    {
      id: '173',
      name: '地税已退费数据修订',
      parent: '165'
    },
    {
      id: '174',
      name: '个人差额补退',
      parent: '165'
    },
    {
      id: '175',
      name: '个人还款处理',
      parent: '165'
    },
    {
      id: '176',
      name: '个人缴费历史修订',
      parent: '165'
    },
    {
      id: '177',
      name: '个人欠费到账实收',
      parent: '165'
    },
    {
      id: '178',
      name: '个人欠款核销',
      parent: '165'
    },
    {
      id: '179',
      name: '社保待遇补拨补扣',
      parent: '165'
    },
    {
      id: '180',
      name: '社保待遇补退',
      parent: '165'
    },
    {
      id: '181',
      name: '社保待遇收回',
      parent: '165'
    },
    {
      id: '182',
      name: '社保待遇停续',
      parent: '165'
    },
    {
      id: '183',
      name: '社保待遇资格认证',
      parent: '165'
    },
    {
      id: '184',
      name: '社保发放方式管理',
      parent: '165'
    },
    {
      id: '185',
      name: '社保咨询及查询',
      parent: '165'
    },
    {
      id: '186',
      name: '影响待遇发放经历信息维护',
      parent: '165'
    },
    {
      id: '187',
      name: '职工个人社保资料变更（个人资料变更（社保部分））',
      parent: '165'
    },
    {
      id: '188',
      name: '重复参保人员合并',
      parent: '165'
    },
    {
      id: '189',
      name: '社会保障卡业务',
      parent: '153'
    },
    {
      id: '190',
      name: '社保卡变更',
      parent: '189'
    },
    {
      id: '191',
      name: '社保卡查询',
      parent: '189'
    },
    {
      id: '192',
      name: '社保卡换卡',
      parent: '189'
    },
    {
      id: '193',
      name: '社保卡检测',
      parent: '189'
    },
    {
      id: '194',
      name: '社保卡社保密码服务',
      parent: '189'
    },
    {
      id: '195',
      name: '社保卡申领',
      parent: '189'
    },
    {
      id: '196',
      name: '社保卡遗失补办',
      parent: '189'
    },
    {
      id: '197',
      name: '社保卡注销',
      parent: '189'
    },
    {
      id: '198',
      name: '失业保险',
      parent: '153'
    },
    {
      id: '199',
      name: '非本省户籍一次性领取失业保险金',
      parent: '198'
    },
    {
      id: '200',
      name: '军转干部失业验证',
      parent: '198'
    },
    {
      id: '201',
      name: '军转干失业待遇申领',
      parent: '198'
    },
    {
      id: '202',
      name: '申领按月失业待遇',
      parent: '198'
    },
    {
      id: '203',
      name: '生育一次性加发失业保险金',
      parent: '198'
    },
    {
      id: '204',
      name: '失业保险视同缴费年限维护',
      parent: '198'
    },
    {
      id: '205',
      name: '失业保险转出',
      parent: '198'
    },
    {
      id: '206',
      name: '失业保险转入',
      parent: '198'
    },
    {
      id: '207',
      name: '失业保险关系省内转入申请',
      parent: '206'
    },
    {
      id: '208',
      name: '失业期间死亡待遇',
      parent: '198'
    },
    {
      id: '209',
      name: '失业期间职业技能鉴定补贴申领',
      parent: '198'
    },
    {
      id: '210',
      name: '失业人员失业验证',
      parent: '198'
    },
    {
      id: '211',
      name: '稳定就业后一次性领取失业保险金',
      parent: '198'
    },
    {
      id: '212',
      name: '原农民工一次性失业生活补助金申领',
      parent: '198'
    },
    {
      id: '213',
      name: '月定期失业待遇重算',
      parent: '198'
    },
    {
      id: '214',
      name: '自主创业后一次性领取失业保险金',
      parent: '198'
    },
    {
      id: '215',
      name: '养老保险',
      parent: '153'
    },
    {
      id: '216',
      name: '部分军队退役人员和军队复员干部军龄视同医保缴费年限审核',
      parent: '215'
    },
    {
      id: '217',
      name: '养老保险视同缴费年限由本市审核确认的人员',
      parent: '216'
    },
    {
      id: '218',
      name: '养老保险视同缴费年限由省社保局审核确认的人员',
      parent: '216'
    },
    {
      id: '219',
      name: '城乡养老申领按月养老金',
      parent: '215'
    },
    {
      id: '220',
      name: '城乡养老增员',
      parent: '215'
    },
    {
      id: '221',
      name: '城乡一次性待遇处理',
      parent: '215'
    },
    {
      id: '222',
      name: '城乡月定期养老待遇重算',
      parent: '215'
    },
    {
      id: '223',
      name: '城镇企业职工基本养老保险关系跨省、省内转出',
      parent: '215'
    },
    {
      id: '224',
      name: '城镇企业职工基本养老保险关系跨省、省内转入',
      parent: '215'
    },
    {
      id: '225',
      name: '跨省养老保险转入申请（一般帐户）',
      parent: '224'
    },
    {
      id: '226',
      name: '城镇职工基本养老保险死亡待遇（退休）',
      parent: '215'
    },
    {
      id: '227',
      name: '城镇职工基本养老保险死亡待遇（在职）',
      parent: '215'
    },
    {
      id: '228',
      name: '机关事业单位人员一次性缴费年限审核',
      parent: '215'
    },
    {
      id: '229',
      name: '居民养老补缴',
      parent: '215'
    },
    {
      id: '230',
      name: '居民养老其他原因退个人账户',
      parent: '215'
    },
    {
      id: '231',
      name: '居民养老欠费核销',
      parent: '215'
    },
    {
      id: '232',
      name: '居民养老人员停保',
      parent: '215'
    },
    {
      id: '233',
      name: '居民养老人员续保',
      parent: '215'
    },
    {
      id: '234',
      name: '居民养老退费',
      parent: '215'
    },
    {
      id: '235',
      name: '军转干部政策性提前退休审批',
      parent: '215'
    },
    {
      id: '236',
      name: '离开机关事业单位人员一次性缴费核定（离开机关事业单位人员一次性缴费）',
      parent: '215'
    },
    {
      id: '237',
      name: '灵活就业人员一次性缴费核定',
      parent: '215'
    },
    {
      id: '238',
      name: '农转居退休死亡',
      parent: '215'
    },
    {
      id: '239',
      name: '农转居退休转城职退休清退',
      parent: '215'
    },
    {
      id: '240',
      name: '农转居月定期养老待遇申领',
      parent: '215'
    },
    {
      id: '241',
      name: '农转居在职死亡',
      parent: '215'
    },
    {
      id: '242',
      name: '企业未参保人员一次性缴费核定（企业未参保人员纳入基本养老一次性缴费）',
      parent: '215'
    },
    {
      id: '243',
      name: '企业职工基本养老保险视同缴费年限审核',
      parent: '215'
    },
    {
      id: '244',
      name: '清退农转居待遇',
      parent: '215'
    },
    {
      id: '245',
      name: '申领一次性养老保险待遇',
      parent: '215'
    },
    {
      id: '246',
      name: '申请按月领取基本养老金',
      parent: '215'
    },
    {
      id: '247',
      name: '申请重新核定基本养老金(月定期养老待遇重算养老年度调整重算)',
      parent: '215'
    },
    {
      id: '248',
      name: '特殊工种提前退休审批',
      parent: '215'
    },
    {
      id: '249',
      name: '退费处理（城镇职工基本养老保险类退费处理）',
      parent: '215'
    },
    {
      id: '250',
      name: '未就业随军配偶基本养老保险关系、军人退役养老保险补助',
      parent: '215'
    },
    {
      id: '251',
      name: '养老保险视同缴费年限维护',
      parent: '215'
    },
    {
      id: '252',
      name: '养老一次性待遇撤销',
      parent: '215'
    },
    {
      id: '253',
      name: '因病或非因工致残提前退休审批',
      parent: '215'
    },
    {
      id: '254',
      name: '早期离开国有集体企业人员一次性缴费年限审核',
      parent: '215'
    },
    {
      id: '255',
      name: '早期下乡知青一次性缴费核定（早期下乡知青一次性缴费）',
      parent: '215'
    },
    {
      id: '256',
      name: '早期下乡知青一次性缴费年限审核',
      parent: '215'
    },
    {
      id: '257',
      name: '市级事项',
      parent: '000'
    },
    {
      id: '258',
      name: '法人业务',
      parent: '257'
    },
    {
      id: '259',
      name: '劳动保障',
      parent: '258'
    },
    {
      id: '260',
      name: '工伤鉴定',
      parent: '259'
    },
    {
      id: '261',
      name: '非因工伤残或因病丧失劳动能力程度鉴定',
      parent: '260'
    },
    {
      id: '262',
      name: '工伤康复对象确认申请',
      parent: '260'
    },
    {
      id: '263',
      name: '工伤职工辅助器具配置确认',
      parent: '260'
    },
    {
      id: '264',
      name: '工伤职工工伤复发确认申请',
      parent: '260'
    },
    {
      id: '265',
      name: '工伤职工劳动功能障碍程度等级复查鉴定申请',
      parent: '260'
    },
    {
      id: '266',
      name: '工伤职工劳动功能障碍程度等级鉴定申请',
      parent: '260'
    },
    {
      id: '267',
      name: '工伤职工生活自理障碍程度等级复查鉴定申请',
      parent: '260'
    },
    {
      id: '268',
      name: '工伤职工生活自理障碍程度等级鉴定申请',
      parent: '260'
    },
    {
      id: '269',
      name: '工伤职工停工留薪期确认',
      parent: '260'
    },
    {
      id: '270',
      name: '劳动仲裁',
      parent: '259'
    },
    {
      id: '271',
      name: '人事人才',
      parent: '258'
    },
    {
      id: '272',
      name: '博士后管理',
      parent: '271'
    },
    {
      id: '273',
      name: '广州市博士后专项经费申报',
      parent: '272'
    },
    {
      id: '274',
      name: '安家费申报',
      parent: '273'
    },
    {
      id: '275',
      name: '科研项目启动费申报',
      parent: '273'
    },
    {
      id: '276',
      name: '生活补助申报',
      parent: '273'
    },
    {
      id: '277',
      name: '新设站（创新实践基地）资助申报',
      parent: '273'
    },
    {
      id: '278',
      name: '申报企业博士后科研工作分站',
      parent: '272'
    },
    {
      id: '279',
      name: '技工教育',
      parent: '271'
    },
    {
      id: '280',
      name: '技工学校设立审批（备注：指市区属技工学校设立审批）',
      parent: '279'
    },
    {
      id: '281',
      name: '技工学校变更审批',
      parent: '280'
    },
    {
      id: '282',
      name: '技工学校设立审批（含分校、分教点的设立，含市县属技工学校审批',
      parent: '280'
    },
    {
      id: '283',
      name: '技工学校注销审批',
      parent: '280'
    },
    {
      id: '284',
      name: '民办技工学校招生简章和广告备案',
      parent: '279'
    },
    {
      id: '285',
      name: '继续教育',
      parent: '271'
    },
    {
      id: '286',
      name: '办理市专业技术人员继续教育基地认定',
      parent: '285'
    },
    {
      id: '287',
      name: '人才引进',
      parent: '271'
    },
    {
      id: '288',
      name: '异地人才引进（含技能人才）',
      parent: '287'
    },
    {
      id: '289',
      name: '职业技能',
      parent: '271'
    },
    {
      id: '290',
      name: '民办职业培训机构名称使用查询',
      parent: '289'
    },
    {
      id: '291',
      name: '变更名称查询',
      parent: '290'
    },
    {
      id: '292',
      name: '举办者为单位',
      parent: '291'
    },
    {
      id: '293',
      name: '举办者为个人',
      parent: '291'
    },
    {
      id: '294',
      name: '补发名称查询',
      parent: '290'
    },
    {
      id: '295',
      name: '举办者为机构',
      parent: '294'
    },
    {
      id: '296',
      name: '设立名称查询',
      parent: '290'
    },
    {
      id: '297',
      name: '延期名称查询',
      parent: '290'
    },
    {
      id: '298',
      name: '注销名称查询',
      parent: '290'
    },
    {
      id: '299',
      name: '市级二类职业技能竞赛的申报以及广州市技术能手称号的申请',
      parent: '289'
    },
    {
      id: '300',
      name: '广州市技术能手称号的申请',
      parent: '299'
    },
    {
      id: '301',
      name: '市级二类职业技能竞赛的申报',
      parent: '299'
    },
    {
      id: '302',
      name: '职业技能鉴定机构设立审批',
      parent: '289'
    },
    {
      id: '303',
      name: '职业技能鉴定机构变更申请（变更鉴鉴定所名称和地址）',
      parent: '302'
    },
    {
      id: '304',
      name: '职业技能鉴定机构设立申请（含增加工种）',
      parent: '302'
    },
    {
      id: '305',
      name: '职业技能鉴定机构延续申请',
      parent: '302'
    },
    {
      id: '306',
      name: '职业技能鉴定机构注销申请',
      parent: '302'
    },
    {
      id: '307',
      name: '社会保险',
      parent: '258'
    },
    {
      id: '308',
      name: '社保查询、变更、转移等业务',
      parent: '307'
    },
    {
      id: '309',
      name: '社保咨询及查询',
      parent: '308'
    },
    {
      id: '310',
      name: '单位信息查询',
      parent: '309'
    },
    {
      id: '311',
      name: '个人信息查询',
      parent: '309'
    },
    {
      id: '312',
      name: '个人业务',
      parent: '257'
    },
    {
      id: '313',
      name: '劳动保障',
      parent: '312'
    },
    {
      id: '314',
      name: '工伤鉴定',
      parent: '313'
    },
    {
      id: '315',
      name: '非因工伤残或因病丧失劳动能力程度鉴定',
      parent: '314'
    },
    {
      id: '316',
      name: '工伤康复对象确认申请',
      parent: '314'
    },
    {
      id: '317',
      name: '工伤职工辅助器具配置确认',
      parent: '314'
    },
    {
      id: '318',
      name: '工伤职工工伤复发确认申请',
      parent: '314'
    },
    {
      id: '319',
      name: '工伤职工劳动功能障碍程度等级复查鉴定申请',
      parent: '314'
    },
    {
      id: '320',
      name: '工伤职工劳动功能障碍程度等级鉴定申请',
      parent: '314'
    },
    {
      id: '321',
      name: '工伤职工生活自理障碍程度等级复查鉴定申请',
      parent: '314'
    },
    {
      id: '322',
      name: '工伤职工生活自理障碍程度等级鉴定申请',
      parent: '314'
    },
    {
      id: '323',
      name: '工伤职工停工留薪期确认',
      parent: '314'
    },
    {
      id: '324',
      name: '劳动仲裁',
      parent: '313'
    },
    {
      id: '325',
      name: '人事人才',
      parent: '312'
    },
    {
      id: '326',
      name: '博士后管理',
      parent: '325'
    },
    {
      id: '327',
      name: '广州市博士后国际培养计划',
      parent: '326'
    },
    {
      id: '328',
      name: '广州市博士后国际培养计划申报',
      parent: '327'
    },
    {
      id: '329',
      name: '广州市博士后国际培养计划未完成情况备案',
      parent: '327'
    },
    {
      id: '330',
      name: '广州市博士后国际培养计划已完成情况备案',
      parent: '327'
    },
    {
      id: '331',
      name: '广州市博士后研究人员进出站备案',
      parent: '326'
    },
    {
      id: '332',
      name: '广州市博士后人员出站备案',
      parent: '331'
    },
    {
      id: '333',
      name: '广州市博士后人员进站备案',
      parent: '331'
    },
    {
      id: '334',
      name: '广州市博士后专项经费申报',
      parent: '326'
    },
    {
      id: '335',
      name: '安家费申报',
      parent: '334'
    },
    {
      id: '336',
      name: '科研项目启动费申报',
      parent: '334'
    },
    {
      id: '337',
      name: '生活补助申报',
      parent: '334'
    },
    {
      id: '338',
      name: '新设站（创新实践基地）资助申报',
      parent: '334'
    },
    {
      id: '339',
      name: '档案管理',
      parent: '325'
    },
    {
      id: '340',
      name: '流动人员人事档案公共服务',
      parent: '339'
    },
    {
      id: '341',
      name: '档案材料归档',
      parent: '340'
    },
    {
      id: '342',
      name: '档案查（借）阅',
      parent: '340'
    },
    {
      id: '343',
      name: '档案接收',
      parent: '340'
    },
    {
      id: '344',
      name: '档案转出',
      parent: '340'
    },
    {
      id: '345',
      name: '党员组织关系的接转',
      parent: '340'
    },
    {
      id: '346',
      name: '为相关单位提供政审（考察）服务',
      parent: '340'
    },
    {
      id: '347',
      name: '依据档案记载出具相关证明',
      parent: '340'
    },
    {
      id: '348',
      name: '高层次人才',
      parent: '325'
    },
    {
      id: '349',
      name: '办理申报“广州市创新领军人才”',
      parent: '348'
    },
    {
      id: '350',
      name: '办理市高层次人才认定',
      parent: '348'
    },
    {
      id: '351',
      name: '广州市“人才梯队工程”申报',
      parent: '348'
    },
    {
      id: '352',
      name: '广州市产业发展和创新人才补贴',
      parent: '348'
    },
    {
      id: '353',
      name: '高校毕业生业务',
      parent: '325'
    },
    {
      id: '354',
      name: '办理高校毕业生档案查询',
      parent: '353'
    },
    {
      id: '355',
      name: '办理高校毕业生未就业登记及报到',
      parent: '353'
    },
    {
      id: '356',
      name: '高校毕业生领取《广州市内入户卡》、入户证明服务',
      parent: '353'
    },
    {
      id: '357',
      name: '非广州生源高校毕业生领取《广州市入户人员信息卡》',
      parent: '356'
    },
    {
      id: '358',
      name: '广州生源高校毕业生领取入户证明服务',
      parent: '356'
    },
    {
      id: '359',
      name: '技工教育',
      parent: '325'
    },
    {
      id: '360',
      name: '技工学校设立审批（备注：指市区属技工学校设立审批）',
      parent: '359'
    },
    {
      id: '361',
      name: '技工学校变更审批',
      parent: '360'
    },
    {
      id: '362',
      name: '技工学校设立审批（含分校、分教点的设立，含市县属技工学校审批',
      parent: '360'
    },
    {
      id: '363',
      name: '技工学校注销审批',
      parent: '360'
    },
    {
      id: '364',
      name: '技工院校和职业培训机构教师上岗资格认定',
      parent: '359'
    },
    {
      id: '365',
      name: '民办技工学校招生简章和广告备案',
      parent: '359'
    },
    {
      id: '366',
      name: '继续教育',
      parent: '325'
    },
    {
      id: '367',
      name: '办理专业技术人员继续教育任务完成情况考核验证',
      parent: '366'
    },
    {
      id: '368',
      name: '留学人员业务',
      parent: '325'
    },
    {
      id: '369',
      name: '办理“广州市留学人员优惠资格证书”',
      parent: '368'
    },
    {
      id: '370',
      name: '办理国（境）外学历学位认证',
      parent: '368'
    },
    {
      id: '371',
      name: '港澳地区学历学位认证',
      parent: '370'
    },
    {
      id: '372',
      name: '国外学历学位认证',
      parent: '370'
    },
    {
      id: '373',
      name: '合作办学学历学位认证',
      parent: '370'
    },
    {
      id: '374',
      name: '台湾地区学历学位认证',
      parent: '370'
    },
    {
      id: '375',
      name: '办理留学人员工作派遣证明',
      parent: '368'
    },
    {
      id: '376',
      name: '公派留学业务申报',
      parent: '368'
    },
    {
      id: '377',
      name: '广州市“菁英计划”留学项目',
      parent: '368'
    },
    {
      id: '378',
      name: '广州市留学人员专项资金',
      parent: '368'
    },
    {
      id: '379',
      name: '安家补助费',
      parent: '378'
    },
    {
      id: '380',
      name: '留学人员短期活动资助',
      parent: '378'
    },
    {
      id: '381',
      name: '留学回国创业人员工商登记注册开具证明',
      parent: '368'
    },
    {
      id: '382',
      name: '留学人员办理档案挂靠',
      parent: '368'
    },
    {
      id: '383',
      name: '留学人员办理户口手续',
      parent: '368'
    },
    {
      id: '384',
      name: '受理留学回国人员申请办理职称评审',
      parent: '368'
    },
    {
      id: '385',
      name: '人才引进',
      parent: '325'
    },
    {
      id: '386',
      name: '广州市人才绿卡',
      parent: '385'
    },
    {
      id: '387',
      name: '异地人才引进（含技能人才）',
      parent: '385'
    },
    {
      id: '388',
      name: '职业技能',
      parent: '325'
    },
    {
      id: '389',
      name: '创业培训补贴申领',
      parent: '388'
    },
    {
      id: '390',
      name: '民办职业培训机构名称使用查询',
      parent: '388'
    },
    {
      id: '391',
      name: '变更名称查询',
      parent: '390'
    },
    {
      id: '392',
      name: '举办者为单位',
      parent: '391'
    },
    {
      id: '393',
      name: '举办者为个人',
      parent: '391'
    },
    {
      id: '394',
      name: '补发名称查询',
      parent: '390'
    },
    {
      id: '395',
      name: '举办者为机构',
      parent: '394'
    },
    {
      id: '396',
      name: '设立名称查询',
      parent: '390'
    },
    {
      id: '397',
      name: '延期名称查询',
      parent: '390'
    },
    {
      id: '398',
      name: '注销名称查询',
      parent: '390'
    },
    {
      id: '399',
      name: '职业资格证书核发',
      parent: '388'
    },
    {
      id: '400',
      name: '专技职称',
      parent: '325'
    },
    {
      id: '401',
      name: '高、中、初级资格申报评审业务',
      parent: '400'
    },
    {
      id: '402',
      name: '全国专业技术人员计算机应用能力考试合格证书遗失补发',
      parent: '400'
    },
    {
      id: '403',
      name: '省外来穗人员专业技术资格确认',
      parent: '400'
    },
    {
      id: '404',
      name: '职称外语成绩证明',
      parent: '400'
    },
    {
      id: '405',
      name: '专业技术资格考核认定',
      parent: '400'
    },
    {
      id: '406',
      name: '专业技术资格考试证书核发',
      parent: '400'
    },
    {
      id: '407',
      name: '专业技术资格考试证书遗失补发（经济专业技术遗失补发除外）',
      parent: '400'
    },
    {
      id: '408',
      name: '专业技术资格考试证书遗失补发（经济专业技术遗失补发除外',
      parent: '407'
    },
    {
      id: '409',
      name: '社会保险',
      parent: '312'
    },
    {
      id: '410',
      name: '社保查询、变更、转移等业务',
      parent: '409'
    },
    {
      id: '411',
      name: '社保咨询及查询',
      parent: '410'
    },
    {
      id: '412',
      name: '单位信息查询',
      parent: '411'
    },
    {
      id: '413',
      name: '个人信息查询',
      parent: '411'
    },
    {
      id: '414',
      name: '行政复议',
      parent: '257'
    },
    {
      id: '415',
      name: '行政复议',
      parent: '414'
    }
  ]


const generateIdMapping = (arr) => arr.reduce((acc, cur, idx) => {
  acc[cur.id] = idx
  return acc
}, {})
const idMapping = generateIdMapping(Lists)


const transform = (arr = Lists) => {
  let root
  arr.forEach(row => {
    if (row.parent === null) {
      root = row
      return
    }
    const parentEl = arr[idMapping[row.parent]]
    parentEl.children = [...(parentEl?.children || []), row]
  })
  return root

}

export const Tree = transform(Lists)

